[
  {"id":"ballabioNovelVariableReduction2014","abstract":"Unsupervised variable reduction methods are intended for reducing the presence of redundancy and multicollinearity in the data. These are common issues when dealing with multivariate analysis associated to large number of variables. With respect to supervised selection, unsupervised reduction aims at selecting subsets of variables able to preserve information, but eliminating redundancy, noise and linearly or near-linearly dependent variables, without considering any dependent response. In this study, we propose the V-WSP algorithm for unsupervised variable reduction, which is a modification of the recently proposed WSP algorithm for design of experiments (DOE). Convergence, performances and comparison with several benchmark algorithms, as well as with other DOE strategies adapted to variable reduction, were evaluated on both simulated, benchmark and real QSAR datasets. The proposed algorithm demonstrated to converge to similar solutions with respect to other reduction strategies, with the advantage to be faster and simpler.","accessed":{"date-parts":[["2024",8,13]]},"author":[{"family":"Ballabio","given":"Davide"},{"family":"Consonni","given":"Viviana"},{"family":"Mauri","given":"Andrea"},{"family":"Claeys-Bruno","given":"Magalie"},{"family":"Sergent","given":"Michelle"},{"family":"Todeschini","given":"Roberto"}],"citation-key":"ballabioNovelVariableReduction2014","container-title":"Chemometrics and Intelligent Laboratory Systems","container-title-short":"Chemometrics and Intelligent Laboratory Systems","DOI":"10.1016/j.chemolab.2014.05.010","ISSN":"0169-7439","issued":{"date-parts":[["2014",8,15]]},"page":"147-154","source":"ScienceDirect","title":"A novel variable reduction method adapted from space-filling designs","type":"article-journal","URL":"https://www.sciencedirect.com/science/article/pii/S0169743914001154","volume":"136"},
  {"id":"santiagoConstructionSpacefillingDesigns2012","abstract":"In the computer experiments setting, if the relationship between the response and the inputs is unknown, then the purpose is to use designs that spread the points at which the response is observed evenly throughout the region. These designs are called space-filling designs (SFD) and the most known are Latin Hypercubes (random, orthogonal, optimized) and low discrepancy sequences. But, simulation codes becoming more and more complex, high dimensional optimal designs are needed to study a high number of parameters (more than 20 parameters) and the construction proves difficult. The aim of this study is to explore a construction method of new space-filling designs for high dimensional spaces. After a short presentation of the criteria considered to quantify the intrinsic quality of the designs, the generation of these designs using WSP algorithm is presented. As the first step consists in generating candidate points, the influence of the initial set of points is investigated in dimension 20 and the final designs are compared with others space-filling designs. Then, designs are proposed in dimension 20, 30, 40 and 50 and the study of the intrinsic quality of these new space-filling designs highlights the robustness of this generation method in high dimensional spaces.","accessed":{"date-parts":[["2024",8,13]]},"author":[{"family":"Santiago","given":"J."},{"family":"Claeys-Bruno","given":"M."},{"family":"Sergent","given":"M."}],"citation-key":"santiagoConstructionSpacefillingDesigns2012","collection-title":"Selected Papers from Chimiométrie 2010","container-title":"Chemometrics and Intelligent Laboratory Systems","container-title-short":"Chemometrics and Intelligent Laboratory Systems","DOI":"10.1016/j.chemolab.2011.06.003","ISSN":"0169-7439","issued":{"date-parts":[["2012",4,15]]},"page":"26-31","source":"ScienceDirect","title":"Construction of space-filling designs using WSP algorithm for high dimensional spaces","type":"article-journal","URL":"https://www.sciencedirect.com/science/article/pii/S0169743911001195","volume":"113"},
  {"id":"shangDiversitySubsamplingCustom2023","abstract":"Subsampling from a large data set is useful in many supervised learning contexts to provide a global view of the data based on only a fraction of the observations. Diverse (or space-ﬁlling) subsampling is an appealing subsampling approach when no prior knowledge of the data is available. In this paper, we propose a diversity subsampling approach that selects a subsample from the original data such that the subsample is independently and uniformly distributed over the support of distribution from which the data are drawn, to the maximum extent possible. We give an asymptotic performance guarantee of the proposed method and provide experimental results to show that the proposed method performs well for typical ﬁnite-size data. We also compare the proposed method with competing diversity subsampling algorithms and demonstrate numerically that subsamples selected by the proposed method are closer to a uniform sample than subsamples selected by other methods. The proposed DS algorithm is shown to be more eﬃcient than known methods and takes only a few minutes to select tens of thousands of subsample points from a data set of size one million. Our DS algorithm easily generalizes to select subsamples following distributions other than uniform. We provide the FADS Python package to implement the proposed methods.","accessed":{"date-parts":[["2024",8,14]]},"author":[{"family":"Shang","given":"Boyang"},{"family":"Apley","given":"Daniel W."},{"family":"Mehrotra","given":"Sanjay"}],"citation-key":"shangDiversitySubsamplingCustom2023","container-title":"INFORMS Journal on Data Science","container-title-short":"INFORMS Journal on Data Science","DOI":"10.1287/ijds.2022.00017","ISSN":"2694-4022, 2694-4030","issue":"2","issued":{"date-parts":[["2023",10]]},"language":"en","page":"161-182","source":"arXiv.org","title":"Diversity Subsampling: Custom Subsamples from Large Data Sets","title-short":"Diversity Subsampling","type":"article-journal","URL":"http://arxiv.org/abs/2206.10812","volume":"2"}
]
